{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v3.2.0", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 320, 320], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "1890_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1890_pad", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1890", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1890", "inbound_nodes": [[["1890_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "801", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "801", "inbound_nodes": [[["1890", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1893_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1893_pad", "inbound_nodes": [[["801", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1893", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1893", "inbound_nodes": [[["1893_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "804", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "804", "inbound_nodes": [[["1893", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "805_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "805_pad", "inbound_nodes": [[["804", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "805", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "805", "inbound_nodes": [[["805_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1896_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1896_pad", "inbound_nodes": [[["805", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1896", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1896", "inbound_nodes": [[["1896_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "808", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "808", "inbound_nodes": [[["1896", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "809_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "809_pad", "inbound_nodes": [[["808", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "809", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "809", "inbound_nodes": [[["809_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1899_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1899_pad", "inbound_nodes": [[["809", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1899", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1899", "inbound_nodes": [[["1899_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "812", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "812", "inbound_nodes": [[["1899", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "813_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "813_pad", "inbound_nodes": [[["812", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "813", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "813", "inbound_nodes": [[["813_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1902_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1902_pad", "inbound_nodes": [[["813", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1902", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1902", "inbound_nodes": [[["1902_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "816", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "816", "inbound_nodes": [[["1902", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "817_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "817_pad", "inbound_nodes": [[["816", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "817", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "817", "inbound_nodes": [[["817_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1905_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1905_pad", "inbound_nodes": [[["817", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1905", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1905", "inbound_nodes": [[["1905_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "820", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "820", "inbound_nodes": [[["1905", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "821_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "821_pad", "inbound_nodes": [[["820", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "821", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "821", "inbound_nodes": [[["821_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1908_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1908_pad", "inbound_nodes": [[["821", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1908", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1908", "inbound_nodes": [[["1908_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "824", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "824", "inbound_nodes": [[["1908", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1911_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "1911_pad", "inbound_nodes": [[["824", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1911", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1911", "inbound_nodes": [[["1911_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "827", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "827", "inbound_nodes": [[["1911", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "828", "trainable": true, "dtype": "float32", "axis": 1}, "name": "828", "inbound_nodes": [[["827", 0, 0, {}], ["824", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1914_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1914_pad", "inbound_nodes": [[["828", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1914", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1914", "inbound_nodes": [[["1914_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "831", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "831", "inbound_nodes": [[["1914", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "848", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "848", "inbound_nodes": [[["831", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "849", "trainable": true, "dtype": "float32", "axis": 1}, "name": "849", "inbound_nodes": [[["848", 0, 0, {}], ["820", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1917_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1917_pad", "inbound_nodes": [[["849", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1917", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1917", "inbound_nodes": [[["1917_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "852", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "852", "inbound_nodes": [[["1917", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "869", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "869", "inbound_nodes": [[["852", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "870", "trainable": true, "dtype": "float32", "axis": 1}, "name": "870", "inbound_nodes": [[["869", 0, 0, {}], ["816", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1920_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1920_pad", "inbound_nodes": [[["870", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1920", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1920", "inbound_nodes": [[["1920_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "873", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "873", "inbound_nodes": [[["1920", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "890", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "890", "inbound_nodes": [[["873", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "891", "trainable": true, "dtype": "float32", "axis": 1}, "name": "891", "inbound_nodes": [[["890", 0, 0, {}], ["812", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1923_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1923_pad", "inbound_nodes": [[["891", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1923", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1923", "inbound_nodes": [[["1923_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "894", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "894", "inbound_nodes": [[["1923", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "911", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "911", "inbound_nodes": [[["894", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "912", "trainable": true, "dtype": "float32", "axis": 1}, "name": "912", "inbound_nodes": [[["911", 0, 0, {}], ["808", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1926_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1926_pad", "inbound_nodes": [[["912", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1926", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1926", "inbound_nodes": [[["1926_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "915", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "915", "inbound_nodes": [[["1926", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "932", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "932", "inbound_nodes": [[["915", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "933", "trainable": true, "dtype": "float32", "axis": 1}, "name": "933", "inbound_nodes": [[["932", 0, 0, {}], ["804", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1929_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1929_pad", "inbound_nodes": [[["933", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1929", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1929", "inbound_nodes": [[["1929_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "936", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "936", "inbound_nodes": [[["1929", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "937", "trainable": true, "dtype": "float32"}, "name": "937", "inbound_nodes": [[["936", 0, 0, {}], ["801", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "938_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "938_pad", "inbound_nodes": [[["937", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "938", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "938", "inbound_nodes": [[["938_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1932_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1932_pad", "inbound_nodes": [[["938", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1932", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1932", "inbound_nodes": [[["1932_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "941", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "941", "inbound_nodes": [[["1932", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1935_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1935_pad", "inbound_nodes": [[["941", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1935", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1935", "inbound_nodes": [[["1935_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "944", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "944", "inbound_nodes": [[["1935", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "945_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "945_pad", "inbound_nodes": [[["944", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "945", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "945", "inbound_nodes": [[["945_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1938_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1938_pad", "inbound_nodes": [[["945", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1938", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1938", "inbound_nodes": [[["1938_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "948", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "948", "inbound_nodes": [[["1938", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "949_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "949_pad", "inbound_nodes": [[["948", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "949", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "949", "inbound_nodes": [[["949_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1941_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1941_pad", "inbound_nodes": [[["949", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1941", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1941", "inbound_nodes": [[["1941_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "952", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "952", "inbound_nodes": [[["1941", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "953_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "953_pad", "inbound_nodes": [[["952", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "953", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "953", "inbound_nodes": [[["953_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1944_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1944_pad", "inbound_nodes": [[["953", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1944", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1944", "inbound_nodes": [[["1944_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "956", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "956", "inbound_nodes": [[["1944", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "957_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "957_pad", "inbound_nodes": [[["956", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "957", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "957", "inbound_nodes": [[["957_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1947_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1947_pad", "inbound_nodes": [[["957", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1947", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1947", "inbound_nodes": [[["1947_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "960", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "960", "inbound_nodes": [[["1947", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1950_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "1950_pad", "inbound_nodes": [[["960", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1950", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1950", "inbound_nodes": [[["1950_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "963", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "963", "inbound_nodes": [[["1950", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "964", "trainable": true, "dtype": "float32", "axis": 1}, "name": "964", "inbound_nodes": [[["963", 0, 0, {}], ["960", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1953_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1953_pad", "inbound_nodes": [[["964", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1953", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1953", "inbound_nodes": [[["1953_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "967", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "967", "inbound_nodes": [[["1953", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "984", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "984", "inbound_nodes": [[["967", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "985", "trainable": true, "dtype": "float32", "axis": 1}, "name": "985", "inbound_nodes": [[["984", 0, 0, {}], ["956", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1956_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1956_pad", "inbound_nodes": [[["985", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1956", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1956", "inbound_nodes": [[["1956_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "988", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "988", "inbound_nodes": [[["1956", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "1005", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "1005", "inbound_nodes": [[["988", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "1006", "trainable": true, "dtype": "float32", "axis": 1}, "name": "1006", "inbound_nodes": [[["1005", 0, 0, {}], ["952", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1959_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1959_pad", "inbound_nodes": [[["1006", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1959", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1959", "inbound_nodes": [[["1959_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1009", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1009", "inbound_nodes": [[["1959", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "1026", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "1026", "inbound_nodes": [[["1009", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "1027", "trainable": true, "dtype": "float32", "axis": 1}, "name": "1027", "inbound_nodes": [[["1026", 0, 0, {}], ["948", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1962_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1962_pad", "inbound_nodes": [[["1027", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1962", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1962", "inbound_nodes": [[["1962_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1030", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1030", "inbound_nodes": [[["1962", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "1047", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "1047", "inbound_nodes": [[["1030", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "1048", "trainable": true, "dtype": "float32", "axis": 1}, "name": "1048", "inbound_nodes": [[["1047", 0, 0, {}], ["944", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1965_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1965_pad", "inbound_nodes": [[["1048", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1965", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1965", "inbound_nodes": [[["1965_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1051", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1051", "inbound_nodes": [[["1965", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "1052", "trainable": true, "dtype": "float32"}, "name": "1052", "inbound_nodes": [[["1051", 0, 0, {}], ["941", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1053_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "1053_pad", "inbound_nodes": [[["1052", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "1053", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "1053", "inbound_nodes": [[["1053_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1968_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1968_pad", "inbound_nodes": [[["1053", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1968", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1968", "inbound_nodes": [[["1968_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1056", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1056", "inbound_nodes": [[["1968", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1971_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1971_pad", "inbound_nodes": [[["1056", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1971", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1971", "inbound_nodes": [[["1971_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1059", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1059", "inbound_nodes": [[["1971", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1060_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "1060_pad", "inbound_nodes": [[["1059", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "1060", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "1060", "inbound_nodes": [[["1060_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1974_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1974_pad", "inbound_nodes": [[["1060", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1974", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1974", "inbound_nodes": [[["1974_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1063", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1063", "inbound_nodes": [[["1974", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1064_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "1064_pad", "inbound_nodes": [[["1063", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "1064", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "1064", "inbound_nodes": [[["1064_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1977_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1977_pad", "inbound_nodes": [[["1064", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1977", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1977", "inbound_nodes": [[["1977_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1067", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1067", "inbound_nodes": [[["1977", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1068_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "1068_pad", "inbound_nodes": [[["1067", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "1068", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "1068", "inbound_nodes": [[["1068_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1980_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1980_pad", "inbound_nodes": [[["1068", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1980", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1980", "inbound_nodes": [[["1980_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1071", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1071", "inbound_nodes": [[["1980", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1983_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "1983_pad", "inbound_nodes": [[["1071", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1983", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1983", "inbound_nodes": [[["1983_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1074", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1074", "inbound_nodes": [[["1983", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "1075", "trainable": true, "dtype": "float32", "axis": 1}, "name": "1075", "inbound_nodes": [[["1074", 0, 0, {}], ["1071", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1986_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1986_pad", "inbound_nodes": [[["1075", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1986", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1986", "inbound_nodes": [[["1986_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1078", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1078", "inbound_nodes": [[["1986", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "1095", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "1095", "inbound_nodes": [[["1078", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "1096", "trainable": true, "dtype": "float32", "axis": 1}, "name": "1096", "inbound_nodes": [[["1095", 0, 0, {}], ["1067", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1989_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1989_pad", "inbound_nodes": [[["1096", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1989", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1989", "inbound_nodes": [[["1989_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1099", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1099", "inbound_nodes": [[["1989", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "1116", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "1116", "inbound_nodes": [[["1099", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "1117", "trainable": true, "dtype": "float32", "axis": 1}, "name": "1117", "inbound_nodes": [[["1116", 0, 0, {}], ["1063", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1992_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1992_pad", "inbound_nodes": [[["1117", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1992", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1992", "inbound_nodes": [[["1992_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1120", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1120", "inbound_nodes": [[["1992", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "1137", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "1137", "inbound_nodes": [[["1120", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "1138", "trainable": true, "dtype": "float32", "axis": 1}, "name": "1138", "inbound_nodes": [[["1137", 0, 0, {}], ["1059", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1995_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1995_pad", "inbound_nodes": [[["1138", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1995", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1995", "inbound_nodes": [[["1995_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "1141", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "1141", "inbound_nodes": [[["1995", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "1142", "trainable": true, "dtype": "float32"}, "name": "1142", "inbound_nodes": [[["1141", 0, 0, {}], ["1056", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1143_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "1143_pad", "inbound_nodes": [[["1142", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "1143", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "1143", "inbound_nodes": [[["1143_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "1998_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "1998_pad", "inbound_nodes": [[["1143", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1998", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1998", "inbound_nodes": 